In [1]:
import os
import numpy as np
import pandas as pd
from lsst.sims.maf.db import ResultsDb
from IPython.display import display, HTML

In [2]:
newruns = ['minion_1016',
           'astro_lsst_01_1016',
           'astro_lsst_01_1015',
           'astro_lsst_01_1017']
#oldruns = ['enigma_1189', 'minion_1016', 'enigma_1281', 'enigma_1282']

In [3]:
pha_new = {}
neo_new = {}
for r in newruns:
    pha_new[r] = ResultsDb(os.path.join('.', r, 'phas_2k_newsky'))
    neo_new[r] = ResultsDb(os.path.join('.', r, 'neo_newsky'))

In [4]:
def make_dataframe(runs, runlist, metricName='CumulativeCompleteness'):
    summary = []
    for r in runlist:
        mId = runs[r].getMetricId(metricName)
        s = runs[r].getSummaryStats(mId, summaryName=None)
        summary.append(pd.DataFrame(zip(s['metricMetadata'], s['summaryValue']*100.0), columns=['metadata', r]))
    df = summary[0]
    for i in range(1, len(summary)):
        df = pd.merge(df, summary[i], how='outer', on='metadata')
    return df

In [6]:
pha_new_df = make_dataframe(pha_new, newruns)
neo_new_df = make_dataframe(neo_new, newruns)

In [7]:
def show_match(metadata, df):
    display(df[df.metadata.str.contains(metadata)])

In [8]:
def show_diff(metadata1, metadata2, df):
    runnames = list(df.columns.values)
    runnames.remove('metadata')
    d = (df[df.metadata.str.contains(metadata2)][runnames].as_matrix() - 
         df[df.metadata.str.contains(metadata1)][runnames].as_matrix())
    diff = pd.DataFrame(d, columns=runnames)
    diff['average'] = np.nanmean(d)
    print "Going from %s to %s:" % (metadata1, metadata2)
    display(diff)

In [9]:
df = pha_new_df
match1 = '3 pairs in 15 nights yr 10'
show_match(match1, df)
match15 = '3 pairs in 30 nights yr 10'
show_match(match15, df)
show_diff(match1, match15, df)
match2 = '3 pairs in 15 nights yr 12'
show_match(match2, df)
show_diff(match1, match2, df)

match3 = '3 pairs in 30 nights yr 12'
show_match(match3, df)
show_diff(match2, match3, df)

match4 = '3 pairs in 30 nights trailing loss yr 12'
show_match(match4, df)
show_diff(match3, match4, df)

#match5 = '3 pairs in 30 nights trailing loss, SNR=4 yr 12'
match5 = '3 pairs in 30 nights, SNR=4 yr 12'
show_match(match5, df)
show_diff(match4, match5, df)

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
19,PHA 3 pairs in 15 nights yr 10,65.55878,66.108125,63.248324,66.50123

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
61,PHA 3 pairs in 30 nights yr 10,68.362613,69.799107,67.513962,70.287272

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 30 nights yr 10:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,2.803833,3.690982,4.265638,3.786042,3.636624

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
129,PHA 3 pairs in 15 nights yr 12,NaN,70.518929,67.343787,70.150929

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 15 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,4.410805,4.095463,3.649699,4.051989

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
150,PHA 3 pairs in 30 nights yr 12,NaN,73.901843,71.703517,73.788041

Going from 3 pairs in 15 nights yr 12 to 3 pairs in 30 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,3.382914,4.35973,3.637112,3.793252

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
147,PHA 3 pairs in 30 nights trailing loss yr 12,NaN,74.825595,74.495694,75.752236

Going from 3 pairs in 30 nights yr 12 to 3 pairs in 30 nights trailing loss yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,0.923752,2.792177,1.964195,1.893374

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
156,"PHA 3 pairs in 30 nights, SNR=4 yr 12",NaN,77.104934,75.734836,77.1828

Going from 3 pairs in 30 nights trailing loss yr 12 to 3 pairs in 30 nights, SNR=4 yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,2.279339,1.239142,1.430564,1.649682

In [10]:
df = neo_new_df
match1 = '3 pairs in 15 nights yr 10'
show_match(match1, df)
match15 = '3 pairs in 30 nights yr 10'
show_match(match15, df)
show_diff(match1, match15, df)
match2 = '3 pairs in 15 nights yr 12'
show_match(match2, df)
show_diff(match1, match2, df)
match3 = '3 pairs in 30 nights yr 12'
show_match(match3, df)
show_diff(match2, match3, df)
match4 = '3 pairs in 30 nights trailing loss yr 12'
show_match(match4, df)
show_diff(match3, match4, df)
match5 = '3 pairs in 30 nights trailing loss, SNR=4 yr 12'
show_match(match5, df)
show_diff(match4, match5, df)

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
7,NEO 3 pairs in 15 nights yr 10,60.655279,56.811208,57.718595,62.42445

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
43,NEO 3 pairs in 30 nights yr 10,63.3371,59.595336,61.847965,65.166977

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 30 nights yr 10:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,2.681821,2.784128,4.129371,2.742527,3.084462

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
141,NEO 3 pairs in 15 nights yr 12,NaN,60.41197,61.361651,65.922897

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 15 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,3.600762,3.643056,3.498447,3.580755

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
159,NEO 3 pairs in 30 nights yr 12,NaN,63.139089,65.518469,68.662914

Going from 3 pairs in 15 nights yr 12 to 3 pairs in 30 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,2.727119,4.156818,2.740017,3.207985

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
153,NEO 3 pairs in 30 nights trailing loss yr 12,NaN,63.883606,67.446558,70.357363

Going from 3 pairs in 30 nights yr 12 to 3 pairs in 30 nights trailing loss yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,0.744518,1.928089,1.694449,1.455685

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
156,"NEO 3 pairs in 30 nights trailing loss, SNR=4 ...",NaN,67.030553,71.502199,73.616514

Going from 3 pairs in 30 nights trailing loss yr 12 to 3 pairs in 30 nights trailing loss, SNR=4 yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,3.146947,4.055641,3.259152,3.487247

In [11]:
# compare NEO completeness to PHA completeness
def show_two(metadata, df1, df2):
    runnames1 = set(df1.columns.values)
    runnames2 = set(df2.columns.values)
    runnames = runnames1.intersection(runnames2)
    runnames = list(runnames)
    runnames.remove('metadata')
    d = (df2[df2.metadata.str.contains(metadata)][runnames].as_matrix() - 
         df1[df1.metadata.str.contains(metadata)][runnames].as_matrix())
    diff = pd.DataFrame(d, columns=runnames)
    diff['average'] = np.nanmean(d)
    display(diff)

match = '3 pairs in 15 nights yr 10'
df1 = pha_new_df
df2 = neo_new_df
show_match(match, df1)
show_match(match, df2)
show_two(match, df1, df2)

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
19,PHA 3 pairs in 15 nights yr 10,65.55878,66.108125,63.248324,66.50123

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
7,NEO 3 pairs in 15 nights yr 10,60.655279,56.811208,57.718595,62.42445

,minion_1016,astro_lsst_01_1015,astro_lsst_01_1017,astro_lsst_01_1016,average
0,-4.903501,-5.52973,-4.07678,-9.296917,-5.951732

In [12]:
df = pha_new_df
criteria = ['PHA 3 pairs in 15 nights yr 10', 'PHA 3 pairs in 30 nights yr 10', 'PHA 3 pairs in 30 nights trailing loss yr 10',
            'PHA 3 pairs in 15 nights yr 12', 'PHA 3 pairs in 30 nights yr 12', 
            'PHA 3 pairs in 30 nights trailing loss yr 12', 'PHA 3 pairs in 30 nights trailing loss, SNR=4 yr 12']
c = criteria[0]
d = df.query('metadata == @c')
for c in criteria[1:]:
    d2 = df.query('metadata == @c')
    d = pd.concat([d, d2])
vals = d.columns.values.copy()
vals[0] = 'Discovery Criteria'
d.columns = vals

pd.set_option('max_colwidth', 65)
def float_format(x):
    if np.isnan(x):
        return '--'
    else:
        return '%.1f' %x
pd.set_option('float_format', float_format)
display(HTML(d.to_html(index=False)))

In [13]:
df = neo_new_df

criteria = ['NEO 3 pairs in 15 nights yr 10', 'NEO 3 pairs in 30 nights yr 10', 'NEO 3 pairs in 30 nights trailing loss yr 10',
            'NEO 3 pairs in 15 nights yr 12', 'NEO 3 pairs in 30 nights yr 12', 
            'NEO 3 pairs in 30 nights trailing loss yr 12', 'NEO 3 pairs in 30 nights trailing loss, SNR=4 yr 12']
c = criteria[0]
d = df.query('metadata == @c')
for c in criteria[1:]:
    d2 = df.query('metadata == @c')
    d = pd.concat([d, d2])
vals = d.columns.values.copy()
vals[0] = 'Discovery Criteria'
d.columns = vals

pd.set_option('max_colwidth', 65)
def float_format(x):
    if np.isnan(x):
        return '--'
    else:
        return '%.1f' %x
pd.set_option('float_format', float_format)
display(HTML(d.to_html(index=False)))